Autodesk.Revit.DB.BRepType
This class defines an enumerative type used to specify the type of output geometry expected from a BRepBuilder.
Since:
2016
Since:
2016

Autodesk.Revit.DB.BRepType.Void
The output geometry is expected to represent a (possibly disconnected) void (i.e., an inverted solid).

Autodesk.Revit.DB.BRepType.Solid
The output geometry is expected to represent a (possibly disconnected) solid.

Autodesk.Revit.DB.BRepType.OpenShell
The output geometry is expected to represent an open shell.